app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    @clientes = Cliente.all

INSERT INTO "clientes" ("nome", "telefone", "endereco", "cpf", "satisfacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cliente
      @cliente = Cliente.find(params[:id])