app/controllers/empregados_controller.rb

  def index
    @empregados = Empregado.all
---
SELECT "empregados".* FROM "empregados"

  def create
    @empregado = Empregado.new(empregado_params)

    respond_to do |format|
      if @empregado.save
---
INSERT INTO "empregados" ("nome", "telefone", "endereco", "rg", "cpf", "dataadm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @empregado.update(empregado_params)
---
UPDATE "empregados" SET "funcao_id" = ?, "updated_at" = ? WHERE "empregados"."id" = ?  [["funcao_id", 1], ["updated_at", "2015-12-14 11:20:31.151067"], ["id", 1]]

    def set_empregado
      @empregado = Empregado.find(params[:id])
---
SELECT  "empregados".* FROM "empregados" WHERE "empregados"."id" = ? LIMIT 1  [["id", 1]]