app/controllers/empregadors_controller.rb

  def index
    @empregadors = Empregador.all
---
SELECT "empregadors".* FROM "empregadors"

  def create
    @empregador = Empregador.new(empregador_params)

    respond_to do |format|
      if @empregador.save
---
INSERT INTO "empregadors" ("nome", "telefone", "endereco", "cnpj", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Arnaldo"], ["telefone", "99855964"], ["endereco", "Rua D"], ["cnpj", "1233425"], ["created_at", "2015-12-14 10:05:51.023899"], ["updated_at", "2015-12-14 10:05:51.023899"]]

    def set_empregador
      @empregador = Empregador.find(params[:id])
---
SELECT  "empregadors".* FROM "empregadors" WHERE "empregadors"."id" = ? LIMIT 1  [["id", 1]]