app/controllers/funcaos_controller.rb

SELECT "funcaos".* FROM "funcaos"
---
  def index
    @funcaos = Funcao.all

INSERT INTO "funcaos" ("tipo", "salario", "ch", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tipo", "Manutençao"], ["salario", 2000.0], ["ch", 40], ["created_at", "2015-12-14 09:57:57.295852"], ["updated_at", "2015-12-14 09:57:57.295852"]]
---
  def create
    @funcao = Funcao.new(funcao_params)

    respond_to do |format|
      if @funcao.save

SELECT  "funcaos".* FROM "funcaos" WHERE "funcaos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_funcao
      @funcao = Funcao.find(params[:id])