app/controllers/ordems_controller.rb

  def index
    @ordems = Ordem.all
---
SELECT "ordems".* FROM "ordems"