app/controllers/tecnicos_controller.rb

  def index
    @tecnicos = Tecnico.all
---
SELECT "tecnicos".* FROM "tecnicos"

  def create
    @tecnico = Tecnico.new(tecnico_params)

    respond_to do |format|
      if @tecnico.save
---
INSERT INTO "tecnicos" ("nome", "cpf", "rg", "endereco", "salario", "dataadm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_tecnico
      @tecnico = Tecnico.find(params[:id])
---
SELECT  "tecnicos".* FROM "tecnicos" WHERE "tecnicos"."id" = ? LIMIT 1  [["id", 1]]